# Task 1 â€“ Data Immersion & Wrangling
# E-commerce Customer Behavior Dataset
# By Challa Tanmay

In [11]:
import pandas as pd

In [12]:
df = pd.read_csv("E-commerce Customer Behavior - Sheet1.csv")  

df.head()

,Customer ID,Gender,Age,City,Membership Type,Total Spend,Items Purchased,Average Rating,Discount Applied,Days Since Last Purchase,Satisfaction Level
0,101,Female,29,New York,Gold,1120.20,14,4.6,True,25,Satisfied
1,102,Male,34,Los Angeles,Silver,780.50,11,4.1,False,18,Neutral
2,103,Female,43,Chicago,Bronze,510.75,9,3.4,True,42,Unsatisfied
3,104,Male,30,San Francisco,Gold,1480.30,19,4.7,False,12,Satisfied
4,105,Male,27,Miami,Silver,720.40,13,4.0,True,55,Unsatisfied

In [13]:
df.info()
print("**")
df.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 11 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Customer ID               350 non-null    int64
 1   Gender                    350 non-null    object
 2   Age                       350 non-null    int64
 3   City                      350 non-null    object
 4   Membership Type           350 non-null    object
 5   Total Spend               350 non-null    float64
 6   Items Purchased           350 non-null    int64
 7   Average Rating            350 non-null    float64
 8   Discount Applied          350 non-null    bool
 9   Days Since Last Purchase  350 non-null    int64
 10  Satisfaction Level        348 non-null    object
dtypes: bool(1), float64(2), int64(4), object(4)
memory usage: 27.8+ KB
**

(350, 11)

In [14]:
#checking if null values are there
df.isnull().sum()
#no nulls are present

Customer ID                 0
Gender                      0
Age                         0
City                        0
Membership Type             0
Total Spend                 0
Items Purchased             0
Average Rating              0
Discount Applied            0
Days Since Last Purchase    0
Satisfaction Level          2
dtype: int64

In [15]:
df.describe()

,Customer ID,Age,Total Spend,Items Purchased,Average Rating,Days Since Last Purchase
count,350.000000,350.000000,350.000000,350.000000,350.000000,350.000000
mean,275.500000,33.597143,845.381714,12.600000,4.019143,26.588571
std,101.180532,4.870882,362.058695,4.155984,0.580539,13.440813
min,101.000000,26.000000,410.800000,7.000000,3.000000,9.000000
25%,188.250000,30.000000,502.000000,9.000000,3.500000,15.000000
50%,275.500000,32.500000,775.200000,12.000000,4.100000,23.000000
75%,362.750000,37.000000,1160.600000,15.000000,4.500000,38.000000
max,450.000000,43.000000,1520.100000,21.000000,4.900000,63.000000

In [16]:
print("Total Duplicates")
df.duplicated().sum()

Total Duplicates

np.int64(0)

In [17]:
df = df.dropna(subset=["Satisfaction Level"])

In [18]:
df['Age'].describe()

count    348.000000
mean      33.577586
std        4.878024
min       26.000000
25%       30.000000
50%       32.000000
75%       37.000000
max       43.000000
Name: Age, dtype: float64

# Feature Engineering

In [19]:
df['Spend Category'] = pd.qcut(df['Total Spend'], 3, labels=["Low", "Medium", "High"])

df['Recency Category'] = pd.cut(
    df['Days Since Last Purchase'],
    bins=[0, 30, 90, 365],
    labels=["Recent", "Moderate", "Inactive"]
)

df['Revenue per Item'] = df['Total Spend'] / df['Items Purchased']

In [23]:
df.head()

,Customer ID,Gender,Age,City,Membership Type,Total Spend,Items Purchased,Average Rating,Discount Applied,Days Since Last Purchase,Satisfaction Level,Spend Category,Recency Category,Revenue per Item
0,101,Female,29,New York,Gold,1120.20,14,4.6,True,25,Satisfied,Medium,Recent,80.014286
1,102,Male,34,Los Angeles,Silver,780.50,11,4.1,False,18,Neutral,Medium,Recent,70.954545
2,103,Female,43,Chicago,Bronze,510.75,9,3.4,True,42,Unsatisfied,Low,Moderate,56.750000
3,104,Male,30,San Francisco,Gold,1480.30,19,4.7,False,12,Satisfied,High,Recent,77.910526
4,105,Male,27,Miami,Silver,720.40,13,4.0,True,55,Unsatisfied,Medium,Moderate,55.415385

In [24]:
df.to_csv("cleaned_customer_data.csv", index=False)

In [25]:
import os
os.getcwd()

'C:\\Users\\Lenovo\\Data Analytics\\Projects\\Apex Technologies Internship'